# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
# cucumber
# - tomato
# - mayonnaise
# - cheese
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ...

def get_bread():
    print('А теперь добавим хлеб')


def get_cutlet():
    print('А теперь добавим котлету')


def get_cucumber():
    print('А теперь добавим огурец')


def get_mayonnaise():
    print('А теперь добавим майонез')


def get_cheese():
    print('А теперь добавим сыр')






