#!/usr/bin/env python3
# -*- coding: utf-8 -*-
from pprint import pprint
# Есть значение радиуса круга
radius = 34

# Выведите на консоль значение прощади этого круга с точностю до 4-х знаков после запятой
# подсказки:
#       формулу можно подсмотреть в интернете,
#       пи возьмите равным 3.1415926
#       точность указывается в функции round()
circle_area = round(2 * 3.1415926 * radius ** 2, 4)
pprint(circle_area)


# Далее, пусть есть координаты точки
point = (23, 34)
# где 23 - координата х, 34 - координата у

# Если точка point лежит внутри того самого круга (radius = 42), то выведите на консоль True,
# Или False, если точка лежит вовне круга.
# подсказки:
#       нужно определить расстояние от этой точки до начала координат (0, 0)
#       формула так же есть в интернете
#       квадратный корень - это возведение в степень 0.5
#       операции сравнения дают булевы константы True и False

pprint(((point[0] ** 2 + point[1] ** 2) ** 0.5) < radius)

# Аналогично для другой точки
point_2 = (30, 30)
# Если точка point_2 лежит внутри круга (radius = 42), то выведите на консоль True,
# Или False, если точка лежит вовне круга.
radius = 42
pprint(((point[0] ** 2 + point[1] ** 2) ** 0.5) < radius)

# Пример вывода на консоль:
#
# 77777.7777
# False
# False


